zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_flashc_v2.h
/***************************************************************************//**
* \file cyip_flashc_v2.h
*
* \brief
* FLASHC IP definitions
*
* \note
* Generator version: 1.3.0.1146
* Database revision: rev#1050929
*
********************************************************************************
* \copyright
* Copyright 2016-2018, Cypress Semiconductor Corporation. All rights reserved.
* SPDX-License-Identifier: Apache-2.0



*******************************************************************************/

#ifndef _CYIP_FLASHC_V2_H_
#define _CYIP_FLASHC_V2_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                    FLASHC
*******************************************************************************/

#define FLASHC_FM_CTL_V2_SECTION_SIZE           0x00001000UL
#define FLASHC_V2_SECTION_SIZE                  0x00010000UL

/**
  * \brief Flash Macro Registers (FLASHC_FM_CTL)
  */
typedef struct {
  __IOM uint32_t FM_CTL;                        /*!< 0x00000000 Flash macro control */
   __IM uint32_t STATUS;                        /*!< 0x00000004 Status */
  __IOM uint32_t FM_ADDR;                       /*!< 0x00000008 Flash macro address */
  __IOM uint32_t BOOKMARK;                      /*!< 0x0000000C Bookmark register - keeps the current FW HV seq */
   __IM uint32_t GEOMETRY;                      /*!< 0x00000010 Regular flash geometry */
   __IM uint32_t GEOMETRY_SUPERVISORY;          /*!< 0x00000014 Supervisory flash geometry */
  __IOM uint32_t ANA_CTL0;                      /*!< 0x00000018 Analog control 0 */
  __IOM uint32_t ANA_CTL1;                      /*!< 0x0000001C Analog control 1 */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t WAIT_CTL;                      /*!< 0x00000028 Wait State control */
   __IM uint32_t RESERVED1[2];
  __IOM uint32_t TIMER_CLK_CTL;                 /*!< 0x00000034 Timer prescaler (clk_t to timer clock frequency divider) */
  __IOM uint32_t TIMER_CTL;                     /*!< 0x00000038 Timer control */
   __OM uint32_t ACLK_CTL;                      /*!< 0x0000003C MPCON clock */
  __IOM uint32_t INTR;                          /*!< 0x00000040 Interrupt */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000044 Interrupt set */
  __IOM uint32_t INTR_MASK;                     /*!< 0x00000048 Interrupt mask */
   __IM uint32_t INTR_MASKED;                   /*!< 0x0000004C Interrupt masked */
  __IOM uint32_t CAL_CTL0;                      /*!< 0x00000050 Cal control BG LO trim bits */
  __IOM uint32_t CAL_CTL1;                      /*!< 0x00000054 Cal control BG HI trim bits */
  __IOM uint32_t CAL_CTL2;                      /*!< 0x00000058 Cal control BG LO&HI trim bits */
  __IOM uint32_t CAL_CTL3;                      /*!< 0x0000005C Cal control osc trim bits, idac, sdac, itim */
  __IOM uint32_t CAL_CTL4;                      /*!< 0x00000060 Cal Control Vlim, SA, fdiv, reg_act */
  __IOM uint32_t CAL_CTL5;                      /*!< 0x00000064 Cal control */
  __IOM uint32_t CAL_CTL6;                      /*!< 0x00000068 SA trim LP/ULP */
  __IOM uint32_t CAL_CTL7;                      /*!< 0x0000006C Cal control */
   __IM uint32_t RESERVED2[4];
  __IOM uint32_t RED_CTL01;                     /*!< 0x00000080 Redundancy Control normal sectors 0,1 */
  __IOM uint32_t RED_CTL23;                     /*!< 0x00000084 Redundancy Control normal sectors 2,3 */
  __IOM uint32_t RED_CTL45;                     /*!< 0x00000088 Redundancy Control normal sectors 4,5 */
  __IOM uint32_t RED_CTL67;                     /*!< 0x0000008C Redundancy Control normal sectors 6,7 */
  __IOM uint32_t RED_CTL_SM01;                  /*!< 0x00000090 Redundancy Control special sectors 0,1 */
   __IM uint32_t RESERVED3;
  __IOM uint32_t RGRANT_DELAY;                  /*!< 0x00000098 R-grant delay */
   __IM uint32_t RESERVED4;
  __IOM uint32_t PW_SEQ12;                      /*!< 0x000000A0 HV Pulse Delay for seq 1&2 pre */
  __IOM uint32_t PW_SEQ23;                      /*!< 0x000000A4 HV Pulse Delay for seq2 post & seq3 */
   __IM uint32_t RESERVED5[469];
  __IOM uint32_t FM_PL_WRDATA_ALL;              /*!< 0x000007FC Flash macro write page latches all */
  __IOM uint32_t FM_PL_DATA[256];               /*!< 0x00000800 Flash macro Page Latches data */
   __IM uint32_t FM_MEM_DATA[256];              /*!< 0x00000C00 Flash macro memory sense amplifier and column decoder data */
} FLASHC_FM_CTL_V2_Type;                        /*!< Size = 4096 (0x1000) */

/**
  * \brief Flash controller (FLASHC)
  */
typedef struct {
  __IOM uint32_t FLASH_CTL;                     /*!< 0x00000000 Control */
  __IOM uint32_t FLASH_PWR_CTL;                 /*!< 0x00000004 Flash power control */
  __IOM uint32_t FLASH_CMD;                     /*!< 0x00000008 Command */
   __IM uint32_t RESERVED[125];
  __IOM uint32_t BIST_CTL;                      /*!< 0x00000200 BIST control */
  __IOM uint32_t BIST_CMD;                      /*!< 0x00000204 BIST command */
  __IOM uint32_t BIST_ADDR_START;               /*!< 0x00000208 BIST address start register */
  __IOM uint32_t BIST_DATA[8];                  /*!< 0x0000020C BIST data register(s) */
   __IM uint32_t BIST_MAIN_DATA_ACT[8];         /*!< 0x0000022C BIST (main) data actual register(s) */
   __IM uint32_t BIST_MAIN_DATA_EXP[8];         /*!< 0x0000024C BIST (main) data expected register(s) */
   __IM uint32_t BIST_MAIN_DATA_ECC_ACT;        /*!< 0x0000026C BIST (main) ECC data actual register */
   __IM uint32_t BIST_MAIN_DATA_ECC_EXP;        /*!< 0x00000270 BIST (main) ECC data expected register */
   __IM uint32_t BIST_MAIN_ADDR;                /*!< 0x00000274 BIST (main) address register */
  __IOM uint32_t BIST_MAIN_STATUS;              /*!< 0x00000278 BIST (main) status register */
   __IM uint32_t BIST_WORK_DATA_ACT;            /*!< 0x0000027C BIST (work) data actual register */
   __IM uint32_t BIST_WORK_DATA_EXP;            /*!< 0x00000280 BIST (work) data expected register */
   __IM uint32_t BIST_WORK_DATA_ECC_ACT;        /*!< 0x00000284 BIST (work) ECC data actual register */
   __IM uint32_t BIST_WORK_DATA_ECC_EXP;        /*!< 0x00000288 BIST (work) ECC data expected register */
   __IM uint32_t BIST_WORK_ADDR;                /*!< 0x0000028C BIST (work) address register */
  __IOM uint32_t BIST_WORK_STATUS;              /*!< 0x00000290 BIST (work) status register */
  __IOM uint32_t BIST_ADDR_STOP;                /*!< 0x00000294 BIST address stop register */
   __IM uint32_t RESERVED1[2];
  __IOM uint32_t ECC_CTL;                       /*!< 0x000002A0 ECC control */
   __IM uint32_t RESERVED2[3];
  __IOM uint32_t FM_SRAM_ECC_CTL0;              /*!< 0x000002B0 eCT Flash SRAM ECC control 0 */
  __IOM uint32_t FM_SRAM_ECC_CTL1;              /*!< 0x000002B4 eCT Flash SRAM ECC control 1 */
   __IM uint32_t FM_SRAM_ECC_CTL2;              /*!< 0x000002B8 eCT Flash SRAM ECC control 2 */
  __IOM uint32_t FM_SRAM_ECC_CTL3;              /*!< 0x000002BC eCT Flash SRAM ECC control 3 */
   __IM uint32_t RESERVED3[80];
  __IOM uint32_t CM0_CA_CTL0;                   /*!< 0x00000400 CM0+ cache control */
  __IOM uint32_t CM0_CA_CTL1;                   /*!< 0x00000404 CM0+ cache control */
  __IOM uint32_t CM0_CA_CTL2;                   /*!< 0x00000408 CM0+ cache control */
   __IM uint32_t RESERVED4[13];
   __IM uint32_t CM0_CA_STATUS0;                /*!< 0x00000440 CM0+ cache status 0 */
   __IM uint32_t CM0_CA_STATUS1;                /*!< 0x00000444 CM0+ cache status 1 */
   __IM uint32_t CM0_CA_STATUS2;                /*!< 0x00000448 CM0+ cache status 2 */
   __IM uint32_t RESERVED5[5];
  __IOM uint32_t CM0_STATUS;                    /*!< 0x00000460 CM0+ interface status */
   __IM uint32_t RESERVED6[7];
  __IOM uint32_t CM4_CA_CTL0;                   /*!< 0x00000480 CM4 cache control */
  __IOM uint32_t CM4_CA_CTL1;                   /*!< 0x00000484 CM4 cache control */
  __IOM uint32_t CM4_CA_CTL2;                   /*!< 0x00000488 CM4 cache control */
   __IM uint32_t RESERVED7[13];
   __IM uint32_t CM4_CA_STATUS0;                /*!< 0x000004C0 CM4 cache status 0 */
   __IM uint32_t CM4_CA_STATUS1;                /*!< 0x000004C4 CM4 cache status 1 */
   __IM uint32_t CM4_CA_STATUS2;                /*!< 0x000004C8 CM4 cache status 2 */
   __IM uint32_t RESERVED8[5];
  __IOM uint32_t CM4_STATUS;                    /*!< 0x000004E0 CM4 interface status */
   __IM uint32_t RESERVED9[7];
  __IOM uint32_t CRYPTO_BUFF_CTL;               /*!< 0x00000500 Cryptography buffer control */
   __IM uint32_t RESERVED10[31];
  __IOM uint32_t DW0_BUFF_CTL;                  /*!< 0x00000580 Datawire 0 buffer control */
   __IM uint32_t RESERVED11[31];
  __IOM uint32_t DW1_BUFF_CTL;                  /*!< 0x00000600 Datawire 1 buffer control */
   __IM uint32_t RESERVED12[31];
  __IOM uint32_t DMAC_BUFF_CTL;                 /*!< 0x00000680 DMA controller buffer control */
   __IM uint32_t RESERVED13[31];
  __IOM uint32_t EXT_MS0_BUFF_CTL;              /*!< 0x00000700 External master 0 buffer control */
   __IM uint32_t RESERVED14[31];
  __IOM uint32_t EXT_MS1_BUFF_CTL;              /*!< 0x00000780 External master 1 buffer control */
   __IM uint32_t RESERVED15[14879];
        FLASHC_FM_CTL_V2_Type FM_CTL;           /*!< 0x0000F000 Flash Macro Registers */
} FLASHC_V2_Type;                               /*!< Size = 65536 (0x10000) */


