zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_flashc_v2.h
/* FLASHC_FM_CTL.FM_CTL */
#define FLASHC_FM_CTL_V2_FM_CTL_FM_MODE_Pos     0UL
#define FLASHC_FM_CTL_V2_FM_CTL_FM_MODE_Msk     0xFUL
#define FLASHC_FM_CTL_V2_FM_CTL_FM_SEQ_Pos      8UL
#define FLASHC_FM_CTL_V2_FM_CTL_FM_SEQ_Msk      0x300UL
#define FLASHC_FM_CTL_V2_FM_CTL_DAA_MUX_SEL_Pos 16UL
#define FLASHC_FM_CTL_V2_FM_CTL_DAA_MUX_SEL_Msk 0x7F0000UL
#define FLASHC_FM_CTL_V2_FM_CTL_IF_SEL_Pos      24UL
#define FLASHC_FM_CTL_V2_FM_CTL_IF_SEL_Msk      0x1000000UL
#define FLASHC_FM_CTL_V2_FM_CTL_WR_EN_Pos       25UL
#define FLASHC_FM_CTL_V2_FM_CTL_WR_EN_Msk       0x2000000UL
/* FLASHC_FM_CTL.STATUS */
#define FLASHC_FM_CTL_V2_STATUS_TIMER_ENABLED_Pos 0UL
#define FLASHC_FM_CTL_V2_STATUS_TIMER_ENABLED_Msk 0x1UL
#define FLASHC_FM_CTL_V2_STATUS_HV_REGS_ISOLATED_Pos 1UL
#define FLASHC_FM_CTL_V2_STATUS_HV_REGS_ISOLATED_Msk 0x2UL
#define FLASHC_FM_CTL_V2_STATUS_ILLEGAL_HVOP_Pos 2UL
#define FLASHC_FM_CTL_V2_STATUS_ILLEGAL_HVOP_Msk 0x4UL
#define FLASHC_FM_CTL_V2_STATUS_TURBO_N_Pos     3UL
#define FLASHC_FM_CTL_V2_STATUS_TURBO_N_Msk     0x8UL
#define FLASHC_FM_CTL_V2_STATUS_WR_EN_MON_Pos   4UL
#define FLASHC_FM_CTL_V2_STATUS_WR_EN_MON_Msk   0x10UL
#define FLASHC_FM_CTL_V2_STATUS_IF_SEL_MON_Pos  5UL
#define FLASHC_FM_CTL_V2_STATUS_IF_SEL_MON_Msk  0x20UL
#define FLASHC_FM_CTL_V2_STATUS_TIMER_STATUS_Pos 6UL
#define FLASHC_FM_CTL_V2_STATUS_TIMER_STATUS_Msk 0x40UL
#define FLASHC_FM_CTL_V2_STATUS_R_GRANT_DELAY_STATUS_Pos 7UL
#define FLASHC_FM_CTL_V2_STATUS_R_GRANT_DELAY_STATUS_Msk 0x80UL
#define FLASHC_FM_CTL_V2_STATUS_FM_BUSY_Pos     8UL
#define FLASHC_FM_CTL_V2_STATUS_FM_BUSY_Msk     0x100UL
#define FLASHC_FM_CTL_V2_STATUS_FM_READY_Pos    9UL
#define FLASHC_FM_CTL_V2_STATUS_FM_READY_Msk    0x200UL
#define FLASHC_FM_CTL_V2_STATUS_POS_PUMP_VLO_Pos 10UL
#define FLASHC_FM_CTL_V2_STATUS_POS_PUMP_VLO_Msk 0x400UL
#define FLASHC_FM_CTL_V2_STATUS_NEG_PUMP_VHI_Pos 11UL
#define FLASHC_FM_CTL_V2_STATUS_NEG_PUMP_VHI_Msk 0x800UL
#define FLASHC_FM_CTL_V2_STATUS_RWW_Pos         12UL
#define FLASHC_FM_CTL_V2_STATUS_RWW_Msk         0x1000UL
#define FLASHC_FM_CTL_V2_STATUS_MAX_DOUT_WIDTH_Pos 13UL
#define FLASHC_FM_CTL_V2_STATUS_MAX_DOUT_WIDTH_Msk 0x2000UL
#define FLASHC_FM_CTL_V2_STATUS_SECTOR0_SR_Pos  14UL
#define FLASHC_FM_CTL_V2_STATUS_SECTOR0_SR_Msk  0x4000UL
#define FLASHC_FM_CTL_V2_STATUS_RESET_MM_Pos    15UL
#define FLASHC_FM_CTL_V2_STATUS_RESET_MM_Msk    0x8000UL
#define FLASHC_FM_CTL_V2_STATUS_ROW_ODD_Pos     16UL
#define FLASHC_FM_CTL_V2_STATUS_ROW_ODD_Msk     0x10000UL
#define FLASHC_FM_CTL_V2_STATUS_ROW_EVEN_Pos    17UL
#define FLASHC_FM_CTL_V2_STATUS_ROW_EVEN_Msk    0x20000UL
#define FLASHC_FM_CTL_V2_STATUS_HVOP_SUB_SECTOR_N_Pos 18UL
#define FLASHC_FM_CTL_V2_STATUS_HVOP_SUB_SECTOR_N_Msk 0x40000UL
#define FLASHC_FM_CTL_V2_STATUS_HVOP_SECTOR_Pos 19UL
#define FLASHC_FM_CTL_V2_STATUS_HVOP_SECTOR_Msk 0x80000UL
#define FLASHC_FM_CTL_V2_STATUS_HVOP_BULK_ALL_Pos 20UL
#define FLASHC_FM_CTL_V2_STATUS_HVOP_BULK_ALL_Msk 0x100000UL
#define FLASHC_FM_CTL_V2_STATUS_CBUS_RA_MATCH_Pos 21UL
#define FLASHC_FM_CTL_V2_STATUS_CBUS_RA_MATCH_Msk 0x200000UL
#define FLASHC_FM_CTL_V2_STATUS_CBUS_RED_ROW_EN_Pos 22UL
#define FLASHC_FM_CTL_V2_STATUS_CBUS_RED_ROW_EN_Msk 0x400000UL
#define FLASHC_FM_CTL_V2_STATUS_RQ_ERROR_Pos    23UL
#define FLASHC_FM_CTL_V2_STATUS_RQ_ERROR_Msk    0x800000UL
#define FLASHC_FM_CTL_V2_STATUS_PUMP_PDAC_Pos   24UL
#define FLASHC_FM_CTL_V2_STATUS_PUMP_PDAC_Msk   0xF000000UL
#define FLASHC_FM_CTL_V2_STATUS_PUMP_NDAC_Pos   28UL
#define FLASHC_FM_CTL_V2_STATUS_PUMP_NDAC_Msk   0xF0000000UL
/* FLASHC_FM_CTL.FM_ADDR */
#define FLASHC_FM_CTL_V2_FM_ADDR_RA_Pos         0UL
#define FLASHC_FM_CTL_V2_FM_ADDR_RA_Msk         0xFFFFUL
#define FLASHC_FM_CTL_V2_FM_ADDR_BA_Pos         16UL
#define FLASHC_FM_CTL_V2_FM_ADDR_BA_Msk         0xFF0000UL
#define FLASHC_FM_CTL_V2_FM_ADDR_AXA_Pos        24UL
#define FLASHC_FM_CTL_V2_FM_ADDR_AXA_Msk        0x1000000UL
/* FLASHC_FM_CTL.BOOKMARK */
#define FLASHC_FM_CTL_V2_BOOKMARK_BOOKMARK_Pos  0UL
#define FLASHC_FM_CTL_V2_BOOKMARK_BOOKMARK_Msk  0xFFFFFFFFUL
/* FLASHC_FM_CTL.GEOMETRY */
#define FLASHC_FM_CTL_V2_GEOMETRY_ROW_COUNT_Pos 0UL
#define FLASHC_FM_CTL_V2_GEOMETRY_ROW_COUNT_Msk 0xFFFFUL
#define FLASHC_FM_CTL_V2_GEOMETRY_BANK_COUNT_Pos 16UL
#define FLASHC_FM_CTL_V2_GEOMETRY_BANK_COUNT_Msk 0xFF0000UL
#define FLASHC_FM_CTL_V2_GEOMETRY_WORD_SIZE_LOG2_Pos 24UL
#define FLASHC_FM_CTL_V2_GEOMETRY_WORD_SIZE_LOG2_Msk 0xF000000UL
#define FLASHC_FM_CTL_V2_GEOMETRY_PAGE_SIZE_LOG2_Pos 28UL
#define FLASHC_FM_CTL_V2_GEOMETRY_PAGE_SIZE_LOG2_Msk 0xF0000000UL
/* FLASHC_FM_CTL.GEOMETRY_SUPERVISORY */
#define FLASHC_FM_CTL_V2_GEOMETRY_SUPERVISORY_ROW_COUNT_Pos 0UL
#define FLASHC_FM_CTL_V2_GEOMETRY_SUPERVISORY_ROW_COUNT_Msk 0xFFFFUL
#define FLASHC_FM_CTL_V2_GEOMETRY_SUPERVISORY_BANK_COUNT_Pos 16UL
#define FLASHC_FM_CTL_V2_GEOMETRY_SUPERVISORY_BANK_COUNT_Msk 0xFF0000UL
#define FLASHC_FM_CTL_V2_GEOMETRY_SUPERVISORY_WORD_SIZE_LOG2_Pos 24UL
#define FLASHC_FM_CTL_V2_GEOMETRY_SUPERVISORY_WORD_SIZE_LOG2_Msk 0xF000000UL
#define FLASHC_FM_CTL_V2_GEOMETRY_SUPERVISORY_PAGE_SIZE_LOG2_Pos 28UL
#define FLASHC_FM_CTL_V2_GEOMETRY_SUPERVISORY_PAGE_SIZE_LOG2_Msk 0xF0000000UL
/* FLASHC_FM_CTL.ANA_CTL0 */
#define FLASHC_FM_CTL_V2_ANA_CTL0_MDAC_Pos      0UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_MDAC_Msk      0xFFUL
#define FLASHC_FM_CTL_V2_ANA_CTL0_CSLDAC_Pos    8UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_CSLDAC_Msk    0x700UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_FLIP_AMUXBUS_AB_Pos 11UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_FLIP_AMUXBUS_AB_Msk 0x800UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_NDAC_MIN_Pos  12UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_NDAC_MIN_Msk  0xF000UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_PDAC_MIN_Pos  16UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_PDAC_MIN_Msk  0xF0000UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_SEQ01_Pos 20UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_SEQ01_Msk 0x300000UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_SEQ12_Pos 22UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_SEQ12_Msk 0xC00000UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_SEQ23_Pos 24UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_SEQ23_Msk 0x3000000UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_SEQ30_Pos 26UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_SEQ30_Msk 0xC000000UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_PEON_Pos 28UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_PEON_Msk 0x30000000UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_PEOFF_Pos 30UL
#define FLASHC_FM_CTL_V2_ANA_CTL0_SCALE_PEOFF_Msk 0xC0000000UL
/* FLASHC_FM_CTL.ANA_CTL1 */
#define FLASHC_FM_CTL_V2_ANA_CTL1_NDAC_MAX_Pos  0UL
#define FLASHC_FM_CTL_V2_ANA_CTL1_NDAC_MAX_Msk  0xFUL
#define FLASHC_FM_CTL_V2_ANA_CTL1_NDAC_STEP_Pos 4UL
#define FLASHC_FM_CTL_V2_ANA_CTL1_NDAC_STEP_Msk 0xF0UL
#define FLASHC_FM_CTL_V2_ANA_CTL1_PDAC_MAX_Pos  8UL
#define FLASHC_FM_CTL_V2_ANA_CTL1_PDAC_MAX_Msk  0xF00UL
#define FLASHC_FM_CTL_V2_ANA_CTL1_PDAC_STEP_Pos 12UL
#define FLASHC_FM_CTL_V2_ANA_CTL1_PDAC_STEP_Msk 0xF000UL
#define FLASHC_FM_CTL_V2_ANA_CTL1_NPDAC_STEP_TIME_Pos 16UL
#define FLASHC_FM_CTL_V2_ANA_CTL1_NPDAC_STEP_TIME_Msk 0xFF0000UL
#define FLASHC_FM_CTL_V2_ANA_CTL1_NPDAC_ZERO_TIME_Pos 24UL
#define FLASHC_FM_CTL_V2_ANA_CTL1_NPDAC_ZERO_TIME_Msk 0xFF000000UL
/* FLASHC_FM_CTL.WAIT_CTL */
#define FLASHC_FM_CTL_V2_WAIT_CTL_WAIT_FM_MEM_RD_Pos 0UL
#define FLASHC_FM_CTL_V2_WAIT_CTL_WAIT_FM_MEM_RD_Msk 0xFUL
#define FLASHC_FM_CTL_V2_WAIT_CTL_WAIT_FM_HV_RD_Pos 8UL
#define FLASHC_FM_CTL_V2_WAIT_CTL_WAIT_FM_HV_RD_Msk 0xF00UL
#define FLASHC_FM_CTL_V2_WAIT_CTL_WAIT_FM_HV_WR_Pos 16UL
#define FLASHC_FM_CTL_V2_WAIT_CTL_WAIT_FM_HV_WR_Msk 0x70000UL
#define FLASHC_FM_CTL_V2_WAIT_CTL_LV_SPARE_1_Pos 24UL
#define FLASHC_FM_CTL_V2_WAIT_CTL_LV_SPARE_1_Msk 0x3F000000UL
/* FLASHC_FM_CTL.TIMER_CLK_CTL */
#define FLASHC_FM_CTL_V2_TIMER_CLK_CTL_TIMER_CLOCK_FREQ_Pos 0UL
#define FLASHC_FM_CTL_V2_TIMER_CLK_CTL_TIMER_CLOCK_FREQ_Msk 0xFFUL
#define FLASHC_FM_CTL_V2_TIMER_CLK_CTL_RGRANT_DELAY_PEON_Pos 8UL
#define FLASHC_FM_CTL_V2_TIMER_CLK_CTL_RGRANT_DELAY_PEON_Msk 0xFF00UL
#define FLASHC_FM_CTL_V2_TIMER_CLK_CTL_RGRANT_DELAY_PEOFF_Pos 16UL
#define FLASHC_FM_CTL_V2_TIMER_CLK_CTL_RGRANT_DELAY_PEOFF_Msk 0xFF0000UL
#define FLASHC_FM_CTL_V2_TIMER_CLK_CTL_RGRANT_DELAY_SEQ01_Pos 24UL
#define FLASHC_FM_CTL_V2_TIMER_CLK_CTL_RGRANT_DELAY_SEQ01_Msk 0xFF000000UL
/* FLASHC_FM_CTL.TIMER_CTL */
#define FLASHC_FM_CTL_V2_TIMER_CTL_PERIOD_Pos   0UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_PERIOD_Msk   0x7FFFUL
#define FLASHC_FM_CTL_V2_TIMER_CTL_SCALE_Pos    15UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_SCALE_Msk    0x8000UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_AUTO_SEQUENCE_Pos 24UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_AUTO_SEQUENCE_Msk 0x1000000UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_PRE_PROG_Pos 25UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_PRE_PROG_Msk 0x2000000UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_PRE_PROG_CSL_Pos 26UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_PRE_PROG_CSL_Msk 0x4000000UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_PUMP_EN_Pos  29UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_PUMP_EN_Msk  0x20000000UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_ACLK_EN_Pos  30UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_ACLK_EN_Msk  0x40000000UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_TIMER_EN_Pos 31UL
#define FLASHC_FM_CTL_V2_TIMER_CTL_TIMER_EN_Msk 0x80000000UL
/* FLASHC_FM_CTL.ACLK_CTL */
#define FLASHC_FM_CTL_V2_ACLK_CTL_ACLK_GEN_Pos  0UL
#define FLASHC_FM_CTL_V2_ACLK_CTL_ACLK_GEN_Msk  0x1UL
/* FLASHC_FM_CTL.INTR */
#define FLASHC_FM_CTL_V2_INTR_TIMER_EXPIRED_Pos 0UL
#define FLASHC_FM_CTL_V2_INTR_TIMER_EXPIRED_Msk 0x1UL
/* FLASHC_FM_CTL.INTR_SET */
#define FLASHC_FM_CTL_V2_INTR_SET_TIMER_EXPIRED_Pos 0UL
#define FLASHC_FM_CTL_V2_INTR_SET_TIMER_EXPIRED_Msk 0x1UL
/* FLASHC_FM_CTL.INTR_MASK */
#define FLASHC_FM_CTL_V2_INTR_MASK_TIMER_EXPIRED_Pos 0UL
#define FLASHC_FM_CTL_V2_INTR_MASK_TIMER_EXPIRED_Msk 0x1UL
/* FLASHC_FM_CTL.INTR_MASKED */
#define FLASHC_FM_CTL_V2_INTR_MASKED_TIMER_EXPIRED_Pos 0UL
#define FLASHC_FM_CTL_V2_INTR_MASKED_TIMER_EXPIRED_Msk 0x1UL
/* FLASHC_FM_CTL.CAL_CTL0 */
#define FLASHC_FM_CTL_V2_CAL_CTL0_VCT_TRIM_LO_HV_Pos 0UL
#define FLASHC_FM_CTL_V2_CAL_CTL0_VCT_TRIM_LO_HV_Msk 0x1FUL
#define FLASHC_FM_CTL_V2_CAL_CTL0_CDAC_LO_HV_Pos 5UL
#define FLASHC_FM_CTL_V2_CAL_CTL0_CDAC_LO_HV_Msk 0xE0UL
#define FLASHC_FM_CTL_V2_CAL_CTL0_VBG_TRIM_LO_HV_Pos 8UL
#define FLASHC_FM_CTL_V2_CAL_CTL0_VBG_TRIM_LO_HV_Msk 0x1F00UL
#define FLASHC_FM_CTL_V2_CAL_CTL0_VBG_TC_TRIM_LO_HV_Pos 13UL
#define FLASHC_FM_CTL_V2_CAL_CTL0_VBG_TC_TRIM_LO_HV_Msk 0xE000UL
#define FLASHC_FM_CTL_V2_CAL_CTL0_ICREF_TC_TRIM_LO_HV_Pos 16UL
#define FLASHC_FM_CTL_V2_CAL_CTL0_ICREF_TC_TRIM_LO_HV_Msk 0x70000UL
#define FLASHC_FM_CTL_V2_CAL_CTL0_IPREF_TRIMA_LO_HV_Pos 19UL
#define FLASHC_FM_CTL_V2_CAL_CTL0_IPREF_TRIMA_LO_HV_Msk 0x80000UL
/* FLASHC_FM_CTL.CAL_CTL1 */
#define FLASHC_FM_CTL_V2_CAL_CTL1_VCT_TRIM_HI_HV_Pos 0UL
#define FLASHC_FM_CTL_V2_CAL_CTL1_VCT_TRIM_HI_HV_Msk 0x1FUL
#define FLASHC_FM_CTL_V2_CAL_CTL1_CDAC_HI_HV_Pos 5UL
#define FLASHC_FM_CTL_V2_CAL_CTL1_CDAC_HI_HV_Msk 0xE0UL
#define FLASHC_FM_CTL_V2_CAL_CTL1_VBG_TRIM_HI_HV_Pos 8UL
#define FLASHC_FM_CTL_V2_CAL_CTL1_VBG_TRIM_HI_HV_Msk 0x1F00UL
#define FLASHC_FM_CTL_V2_CAL_CTL1_VBG_TC_TRIM_HI_HV_Pos 13UL
#define FLASHC_FM_CTL_V2_CAL_CTL1_VBG_TC_TRIM_HI_HV_Msk 0xE000UL
#define FLASHC_FM_CTL_V2_CAL_CTL1_ICREF_TC_TRIM_HI_HV_Pos 16UL
#define FLASHC_FM_CTL_V2_CAL_CTL1_ICREF_TC_TRIM_HI_HV_Msk 0x70000UL
#define FLASHC_FM_CTL_V2_CAL_CTL1_IPREF_TRIMA_HI_HV_Pos 19UL
#define FLASHC_FM_CTL_V2_CAL_CTL1_IPREF_TRIMA_HI_HV_Msk 0x80000UL
/* FLASHC_FM_CTL.CAL_CTL2 */
#define FLASHC_FM_CTL_V2_CAL_CTL2_ICREF_TRIM_LO_HV_Pos 0UL
#define FLASHC_FM_CTL_V2_CAL_CTL2_ICREF_TRIM_LO_HV_Msk 0x1FUL
#define FLASHC_FM_CTL_V2_CAL_CTL2_ICREF_TRIM_HI_HV_Pos 5UL
#define FLASHC_FM_CTL_V2_CAL_CTL2_ICREF_TRIM_HI_HV_Msk 0x3E0UL
#define FLASHC_FM_CTL_V2_CAL_CTL2_IPREF_TRIM_LO_HV_Pos 10UL
#define FLASHC_FM_CTL_V2_CAL_CTL2_IPREF_TRIM_LO_HV_Msk 0x7C00UL
#define FLASHC_FM_CTL_V2_CAL_CTL2_IPREF_TRIM_HI_HV_Pos 15UL
#define FLASHC_FM_CTL_V2_CAL_CTL2_IPREF_TRIM_HI_HV_Msk 0xF8000UL
/* FLASHC_FM_CTL.CAL_CTL3 */
#define FLASHC_FM_CTL_V2_CAL_CTL3_OSC_TRIM_HV_Pos 0UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_OSC_TRIM_HV_Msk 0xFUL
#define FLASHC_FM_CTL_V2_CAL_CTL3_OSC_RANGE_TRIM_HV_Pos 4UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_OSC_RANGE_TRIM_HV_Msk 0x10UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_VPROT_ACT_HV_Pos 5UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_VPROT_ACT_HV_Msk 0x20UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_IPREF_TC_HV_Pos 6UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_IPREF_TC_HV_Msk 0x40UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_VREF_SEL_HV_Pos 7UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_VREF_SEL_HV_Msk 0x80UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_IREF_SEL_HV_Pos 8UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_IREF_SEL_HV_Msk 0x100UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_REG_ACT_HV_Pos 9UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_REG_ACT_HV_Msk 0x200UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_FDIV_TRIM_HV_Pos 10UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_FDIV_TRIM_HV_Msk 0xC00UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_VDDHI_HV_Pos  12UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_VDDHI_HV_Msk  0x1000UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_TURBO_PULSEW_HV_Pos 13UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_TURBO_PULSEW_HV_Msk 0x6000UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_BGLO_EN_HV_Pos 15UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_BGLO_EN_HV_Msk 0x8000UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_BGHI_EN_HV_Pos 16UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_BGHI_EN_HV_Msk 0x10000UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_CL_ISO_DIS_HV_Pos 17UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_CL_ISO_DIS_HV_Msk 0x20000UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_R_GRANT_EN_HV_Pos 18UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_R_GRANT_EN_HV_Msk 0x40000UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_LP_ULP_SW_HV_Pos 19UL
#define FLASHC_FM_CTL_V2_CAL_CTL3_LP_ULP_SW_HV_Msk 0x80000UL
/* FLASHC_FM_CTL.CAL_CTL4 */
#define FLASHC_FM_CTL_V2_CAL_CTL4_VLIM_TRIM_ULP_HV_Pos 0UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_VLIM_TRIM_ULP_HV_Msk 0x3UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_IDAC_ULP_HV_Pos 2UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_IDAC_ULP_HV_Msk 0x3CUL
#define FLASHC_FM_CTL_V2_CAL_CTL4_SDAC_ULP_HV_Pos 6UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_SDAC_ULP_HV_Msk 0xC0UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_ITIM_ULP_HV_Pos 8UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_ITIM_ULP_HV_Msk 0x1F00UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_FM_READY_DEL_ULP_HV_Pos 13UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_FM_READY_DEL_ULP_HV_Msk 0x2000UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_SPARE451_ULP_HV_Pos 14UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_SPARE451_ULP_HV_Msk 0xC000UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_READY_RESTART_N_HV_Pos 16UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_READY_RESTART_N_HV_Msk 0x10000UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_SPARE41_HV_Pos 17UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_SPARE41_HV_Msk 0x20000UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_AUTO_HVPULSE_HV_Pos 18UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_AUTO_HVPULSE_HV_Msk 0x40000UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_UGB_EN_HV_Pos 19UL
#define FLASHC_FM_CTL_V2_CAL_CTL4_UGB_EN_HV_Msk 0x80000UL
/* FLASHC_FM_CTL.CAL_CTL5 */
#define FLASHC_FM_CTL_V2_CAL_CTL5_VLIM_TRIM_LP_HV_Pos 0UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_VLIM_TRIM_LP_HV_Msk 0x3UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_IDAC_LP_HV_Pos 2UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_IDAC_LP_HV_Msk 0x3CUL
#define FLASHC_FM_CTL_V2_CAL_CTL5_SDAC_LP_HV_Pos 6UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_SDAC_LP_HV_Msk 0xC0UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_ITIM_LP_HV_Pos 8UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_ITIM_LP_HV_Msk 0x1F00UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_FM_READY_DEL_LP_HV_Pos 13UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_FM_READY_DEL_LP_HV_Msk 0x2000UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_SPARE451_LP_HV_Pos 14UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_SPARE451_LP_HV_Msk 0xC000UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_SPARE52_HV_Pos 16UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_SPARE52_HV_Msk 0x30000UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_AMUX_SEL_HV_Pos 18UL
#define FLASHC_FM_CTL_V2_CAL_CTL5_AMUX_SEL_HV_Msk 0xC0000UL
/* FLASHC_FM_CTL.CAL_CTL6 */
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T1_ULP_HV_Pos 0UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T1_ULP_HV_Msk 0x1UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T4_ULP_HV_Pos 1UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T4_ULP_HV_Msk 0xEUL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T5_ULP_HV_Pos 4UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T5_ULP_HV_Msk 0x70UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T6_ULP_HV_Pos 7UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T6_ULP_HV_Msk 0x180UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T8_ULP_HV_Pos 9UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T8_ULP_HV_Msk 0x200UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T1_LP_HV_Pos 10UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T1_LP_HV_Msk 0x400UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T4_LP_HV_Pos 11UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T4_LP_HV_Msk 0x3800UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T5_LP_HV_Pos 14UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T5_LP_HV_Msk 0x1C000UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T6_LP_HV_Pos 17UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T6_LP_HV_Msk 0x60000UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T8_LP_HV_Pos 19UL
#define FLASHC_FM_CTL_V2_CAL_CTL6_SA_CTL_TRIM_T8_LP_HV_Msk 0x80000UL
/* FLASHC_FM_CTL.CAL_CTL7 */
#define FLASHC_FM_CTL_V2_CAL_CTL7_ERSX8_CLK_SEL_HV_Pos 0UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_ERSX8_CLK_SEL_HV_Msk 0x3UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_FM_ACTIVE_HV_Pos 2UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_FM_ACTIVE_HV_Msk 0x4UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_TURBO_EXT_HV_Pos 3UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_TURBO_EXT_HV_Msk 0x8UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_NPDAC_HWCTL_DIS_HV_Pos 4UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_NPDAC_HWCTL_DIS_HV_Msk 0x10UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_FM_READY_DIS_HV_Pos 5UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_FM_READY_DIS_HV_Msk 0x20UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_ERSX8_EN_ALL_HV_Pos 6UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_ERSX8_EN_ALL_HV_Msk 0x40UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_SPARE7_HV_Pos 7UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_SPARE7_HV_Msk 0x380UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_SPARE7_ULP_HV_Pos 10UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_SPARE7_ULP_HV_Msk 0x7C00UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_SPARE7_LP_HV_Pos 15UL
#define FLASHC_FM_CTL_V2_CAL_CTL7_SPARE7_LP_HV_Msk 0xF8000UL
/* FLASHC_FM_CTL.RED_CTL01 */
#define FLASHC_FM_CTL_V2_RED_CTL01_RED_ADDR_0_Pos 0UL
#define FLASHC_FM_CTL_V2_RED_CTL01_RED_ADDR_0_Msk 0xFFUL
#define FLASHC_FM_CTL_V2_RED_CTL01_RED_EN_0_Pos 8UL
#define FLASHC_FM_CTL_V2_RED_CTL01_RED_EN_0_Msk 0x100UL
#define FLASHC_FM_CTL_V2_RED_CTL01_RED_ADDR_1_Pos 16UL
#define FLASHC_FM_CTL_V2_RED_CTL01_RED_ADDR_1_Msk 0xFF0000UL
#define FLASHC_FM_CTL_V2_RED_CTL01_RED_EN_1_Pos 24UL
#define FLASHC_FM_CTL_V2_RED_CTL01_RED_EN_1_Msk 0x1000000UL
/* FLASHC_FM_CTL.RED_CTL23 */
#define FLASHC_FM_CTL_V2_RED_CTL23_RED_ADDR_2_Pos 0UL
#define FLASHC_FM_CTL_V2_RED_CTL23_RED_ADDR_2_Msk 0xFFUL
#define FLASHC_FM_CTL_V2_RED_CTL23_RED_EN_2_Pos 8UL
#define FLASHC_FM_CTL_V2_RED_CTL23_RED_EN_2_Msk 0x100UL
#define FLASHC_FM_CTL_V2_RED_CTL23_RED_ADDR_3_Pos 16UL
#define FLASHC_FM_CTL_V2_RED_CTL23_RED_ADDR_3_Msk 0xFF0000UL
#define FLASHC_FM_CTL_V2_RED_CTL23_RED_EN_3_Pos 24UL
#define FLASHC_FM_CTL_V2_RED_CTL23_RED_EN_3_Msk 0x1000000UL
/* FLASHC_FM_CTL.RED_CTL45 */
#define FLASHC_FM_CTL_V2_RED_CTL45_RED_ADDR_4_Pos 0UL
#define FLASHC_FM_CTL_V2_RED_CTL45_RED_ADDR_4_Msk 0xFFUL
#define FLASHC_FM_CTL_V2_RED_CTL45_RED_EN_4_Pos 8UL
#define FLASHC_FM_CTL_V2_RED_CTL45_RED_EN_4_Msk 0x100UL
#define FLASHC_FM_CTL_V2_RED_CTL45_RED_ADDR_5_Pos 16UL
#define FLASHC_FM_CTL_V2_RED_CTL45_RED_ADDR_5_Msk 0xFF0000UL
#define FLASHC_FM_CTL_V2_RED_CTL45_RED_EN_5_Pos 24UL
#define FLASHC_FM_CTL_V2_RED_CTL45_RED_EN_5_Msk 0x1000000UL
/* FLASHC_FM_CTL.RED_CTL67 */
#define FLASHC_FM_CTL_V2_RED_CTL67_RED_ADDR_6_Pos 0UL
#define FLASHC_FM_CTL_V2_RED_CTL67_RED_ADDR_6_Msk 0xFFUL
#define FLASHC_FM_CTL_V2_RED_CTL67_RED_EN_6_Pos 8UL
#define FLASHC_FM_CTL_V2_RED_CTL67_RED_EN_6_Msk 0x100UL
#define FLASHC_FM_CTL_V2_RED_CTL67_RED_ADDR_7_Pos 16UL
#define FLASHC_FM_CTL_V2_RED_CTL67_RED_ADDR_7_Msk 0xFF0000UL
#define FLASHC_FM_CTL_V2_RED_CTL67_RED_EN_7_Pos 24UL
#define FLASHC_FM_CTL_V2_RED_CTL67_RED_EN_7_Msk 0x1000000UL
/* FLASHC_FM_CTL.RED_CTL_SM01 */
#define FLASHC_FM_CTL_V2_RED_CTL_SM01_RED_ADDR_SM0_Pos 0UL
#define FLASHC_FM_CTL_V2_RED_CTL_SM01_RED_ADDR_SM0_Msk 0xFFUL
#define FLASHC_FM_CTL_V2_RED_CTL_SM01_RED_EN_SM0_Pos 8UL
#define FLASHC_FM_CTL_V2_RED_CTL_SM01_RED_EN_SM0_Msk 0x100UL
#define FLASHC_FM_CTL_V2_RED_CTL_SM01_RED_ADDR_SM1_Pos 16UL
#define FLASHC_FM_CTL_V2_RED_CTL_SM01_RED_ADDR_SM1_Msk 0xFF0000UL
#define FLASHC_FM_CTL_V2_RED_CTL_SM01_RED_EN_SM1_Pos 24UL
#define FLASHC_FM_CTL_V2_RED_CTL_SM01_RED_EN_SM1_Msk 0x1000000UL
/* FLASHC_FM_CTL.RGRANT_DELAY */
#define FLASHC_FM_CTL_V2_RGRANT_DELAY_RGRANT_DELAY_SEQ12_Pos 0UL
#define FLASHC_FM_CTL_V2_RGRANT_DELAY_RGRANT_DELAY_SEQ12_Msk 0xFFUL
#define FLASHC_FM_CTL_V2_RGRANT_DELAY_RGRANT_DELAY_SEQ23_Pos 8UL
#define FLASHC_FM_CTL_V2_RGRANT_DELAY_RGRANT_DELAY_SEQ23_Msk 0xFF00UL
#define FLASHC_FM_CTL_V2_RGRANT_DELAY_RGRANT_DELAY_SEQ30_Pos 16UL
#define FLASHC_FM_CTL_V2_RGRANT_DELAY_RGRANT_DELAY_SEQ30_Msk 0xFF0000UL
#define FLASHC_FM_CTL_V2_RGRANT_DELAY_RGRANT_DELAY_CLK_Pos 24UL
#define FLASHC_FM_CTL_V2_RGRANT_DELAY_RGRANT_DELAY_CLK_Msk 0xF000000UL
#define FLASHC_FM_CTL_V2_RGRANT_DELAY_HV_PARAMS_LOADED_Pos 31UL
#define FLASHC_FM_CTL_V2_RGRANT_DELAY_HV_PARAMS_LOADED_Msk 0x80000000UL
/* FLASHC_FM_CTL.PW_SEQ12 */
#define FLASHC_FM_CTL_V2_PW_SEQ12_PW_SEQ1_Pos   0UL
#define FLASHC_FM_CTL_V2_PW_SEQ12_PW_SEQ1_Msk   0xFFFFUL
#define FLASHC_FM_CTL_V2_PW_SEQ12_PW_SEQ2_PRE_Pos 16UL
#define FLASHC_FM_CTL_V2_PW_SEQ12_PW_SEQ2_PRE_Msk 0xFFFF0000UL
/* FLASHC_FM_CTL.PW_SEQ23 */
#define FLASHC_FM_CTL_V2_PW_SEQ23_PW_SEQ2_POST_Pos 0UL
#define FLASHC_FM_CTL_V2_PW_SEQ23_PW_SEQ2_POST_Msk 0xFFFFUL
#define FLASHC_FM_CTL_V2_PW_SEQ23_PW_SEQ3_Pos   16UL
#define FLASHC_FM_CTL_V2_PW_SEQ23_PW_SEQ3_Msk   0xFFFF0000UL
/* FLASHC_FM_CTL.FM_PL_WRDATA_ALL */
#define FLASHC_FM_CTL_V2_FM_PL_WRDATA_ALL_DATA32_Pos 0UL
#define FLASHC_FM_CTL_V2_FM_PL_WRDATA_ALL_DATA32_Msk 0xFFFFFFFFUL
/* FLASHC_FM_CTL.FM_PL_DATA */
#define FLASHC_FM_CTL_V2_FM_PL_DATA_DATA32_Pos  0UL
#define FLASHC_FM_CTL_V2_FM_PL_DATA_DATA32_Msk  0xFFFFFFFFUL
/* FLASHC_FM_CTL.FM_MEM_DATA */
#define FLASHC_FM_CTL_V2_FM_MEM_DATA_DATA32_Pos 0UL
#define FLASHC_FM_CTL_V2_FM_MEM_DATA_DATA32_Msk 0xFFFFFFFFUL


