zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_flashc_v2.h
/* FLASHC.FLASH_CTL */
#define FLASHC_V2_FLASH_CTL_MAIN_WS_Pos         0UL
#define FLASHC_V2_FLASH_CTL_MAIN_WS_Msk         0xFUL
#define FLASHC_V2_FLASH_CTL_MAIN_MAP_Pos        8UL
#define FLASHC_V2_FLASH_CTL_MAIN_MAP_Msk        0x100UL
#define FLASHC_V2_FLASH_CTL_WORK_MAP_Pos        9UL
#define FLASHC_V2_FLASH_CTL_WORK_MAP_Msk        0x200UL
#define FLASHC_V2_FLASH_CTL_MAIN_BANK_MODE_Pos  12UL
#define FLASHC_V2_FLASH_CTL_MAIN_BANK_MODE_Msk  0x1000UL
#define FLASHC_V2_FLASH_CTL_WORK_BANK_MODE_Pos  13UL
#define FLASHC_V2_FLASH_CTL_WORK_BANK_MODE_Msk  0x2000UL
#define FLASHC_V2_FLASH_CTL_MAIN_ECC_EN_Pos     16UL
#define FLASHC_V2_FLASH_CTL_MAIN_ECC_EN_Msk     0x10000UL
#define FLASHC_V2_FLASH_CTL_MAIN_ECC_INJ_EN_Pos 17UL
#define FLASHC_V2_FLASH_CTL_MAIN_ECC_INJ_EN_Msk 0x20000UL
#define FLASHC_V2_FLASH_CTL_MAIN_ERR_SILENT_Pos 18UL
#define FLASHC_V2_FLASH_CTL_MAIN_ERR_SILENT_Msk 0x40000UL
#define FLASHC_V2_FLASH_CTL_WORK_ECC_EN_Pos     20UL
#define FLASHC_V2_FLASH_CTL_WORK_ECC_EN_Msk     0x100000UL
#define FLASHC_V2_FLASH_CTL_WORK_ECC_INJ_EN_Pos 21UL
#define FLASHC_V2_FLASH_CTL_WORK_ECC_INJ_EN_Msk 0x200000UL
#define FLASHC_V2_FLASH_CTL_WORK_ERR_SILENT_Pos 22UL
#define FLASHC_V2_FLASH_CTL_WORK_ERR_SILENT_Msk 0x400000UL
/* FLASHC.FLASH_PWR_CTL */
#define FLASHC_V2_FLASH_PWR_CTL_ENABLE_Pos      0UL
#define FLASHC_V2_FLASH_PWR_CTL_ENABLE_Msk      0x1UL
#define FLASHC_V2_FLASH_PWR_CTL_ENABLE_HV_Pos   1UL
#define FLASHC_V2_FLASH_PWR_CTL_ENABLE_HV_Msk   0x2UL
/* FLASHC.FLASH_CMD */
#define FLASHC_V2_FLASH_CMD_INV_Pos             0UL
#define FLASHC_V2_FLASH_CMD_INV_Msk             0x1UL
#define FLASHC_V2_FLASH_CMD_BUFF_INV_Pos        1UL
#define FLASHC_V2_FLASH_CMD_BUFF_INV_Msk        0x2UL
/* FLASHC.BIST_CTL */
#define FLASHC_V2_BIST_CTL_OPCODE_Pos           0UL
#define FLASHC_V2_BIST_CTL_OPCODE_Msk           0x3UL
#define FLASHC_V2_BIST_CTL_UP_Pos               2UL
#define FLASHC_V2_BIST_CTL_UP_Msk               0x4UL
#define FLASHC_V2_BIST_CTL_ROW_FIRST_Pos        3UL
#define FLASHC_V2_BIST_CTL_ROW_FIRST_Msk        0x8UL
#define FLASHC_V2_BIST_CTL_ADDR_START_ENABLED_Pos 4UL
#define FLASHC_V2_BIST_CTL_ADDR_START_ENABLED_Msk 0x10UL
#define FLASHC_V2_BIST_CTL_ADDR_COMPLIMENT_ENABLED_Pos 5UL
#define FLASHC_V2_BIST_CTL_ADDR_COMPLIMENT_ENABLED_Msk 0x20UL
#define FLASHC_V2_BIST_CTL_INCR_DECR_BOTH_Pos   6UL
#define FLASHC_V2_BIST_CTL_INCR_DECR_BOTH_Msk   0x40UL
#define FLASHC_V2_BIST_CTL_STOP_ON_ERROR_Pos    7UL
#define FLASHC_V2_BIST_CTL_STOP_ON_ERROR_Msk    0x80UL
#define FLASHC_V2_BIST_CTL_FM_REGION_TYPE_Pos   8UL
#define FLASHC_V2_BIST_CTL_FM_REGION_TYPE_Msk   0x300UL
#define FLASHC_V2_BIST_CTL_ECC_EN_Pos           12UL
#define FLASHC_V2_BIST_CTL_ECC_EN_Msk           0x1000UL
#define FLASHC_V2_BIST_CTL_ADDR_STOP_ENABLED_Pos 16UL
#define FLASHC_V2_BIST_CTL_ADDR_STOP_ENABLED_Msk 0x10000UL
/* FLASHC.BIST_CMD */
#define FLASHC_V2_BIST_CMD_MAIN_START_Pos       0UL
#define FLASHC_V2_BIST_CMD_MAIN_START_Msk       0x1UL
#define FLASHC_V2_BIST_CMD_WORK_START_Pos       1UL
#define FLASHC_V2_BIST_CMD_WORK_START_Msk       0x2UL
/* FLASHC.BIST_ADDR_START */
#define FLASHC_V2_BIST_ADDR_START_COL_ADDR_START_Pos 0UL
#define FLASHC_V2_BIST_ADDR_START_COL_ADDR_START_Msk 0xFFFFUL
#define FLASHC_V2_BIST_ADDR_START_ROW_ADDR_START_Pos 16UL
#define FLASHC_V2_BIST_ADDR_START_ROW_ADDR_START_Msk 0xFFFF0000UL
/* FLASHC.BIST_DATA */
#define FLASHC_V2_BIST_DATA_DATA_Pos            0UL
#define FLASHC_V2_BIST_DATA_DATA_Msk            0xFFFFFFFFUL
/* FLASHC.BIST_MAIN_DATA_ACT */
#define FLASHC_V2_BIST_MAIN_DATA_ACT_DATA_Pos   0UL
#define FLASHC_V2_BIST_MAIN_DATA_ACT_DATA_Msk   0xFFFFFFFFUL
/* FLASHC.BIST_MAIN_DATA_EXP */
#define FLASHC_V2_BIST_MAIN_DATA_EXP_DATA_Pos   0UL
#define FLASHC_V2_BIST_MAIN_DATA_EXP_DATA_Msk   0xFFFFFFFFUL
/* FLASHC.BIST_MAIN_DATA_ECC_ACT */
#define FLASHC_V2_BIST_MAIN_DATA_ECC_ACT_DATA_Pos 0UL
#define FLASHC_V2_BIST_MAIN_DATA_ECC_ACT_DATA_Msk 0xFFFFFFFFUL
/* FLASHC.BIST_MAIN_DATA_ECC_EXP */
#define FLASHC_V2_BIST_MAIN_DATA_ECC_EXP_DATA_Pos 0UL
#define FLASHC_V2_BIST_MAIN_DATA_ECC_EXP_DATA_Msk 0xFFFFFFFFUL
/* FLASHC.BIST_MAIN_ADDR */
#define FLASHC_V2_BIST_MAIN_ADDR_COL_ADDR_Pos   0UL
#define FLASHC_V2_BIST_MAIN_ADDR_COL_ADDR_Msk   0xFFFFUL
#define FLASHC_V2_BIST_MAIN_ADDR_ROW_ADDR_Pos   16UL
#define FLASHC_V2_BIST_MAIN_ADDR_ROW_ADDR_Msk   0xFFFF0000UL
/* FLASHC.BIST_MAIN_STATUS */
#define FLASHC_V2_BIST_MAIN_STATUS_FAIL_Pos     0UL
#define FLASHC_V2_BIST_MAIN_STATUS_FAIL_Msk     0x1UL
/* FLASHC.BIST_WORK_DATA_ACT */
#define FLASHC_V2_BIST_WORK_DATA_ACT_DATA_Pos   0UL
#define FLASHC_V2_BIST_WORK_DATA_ACT_DATA_Msk   0xFFFFFFFFUL
/* FLASHC.BIST_WORK_DATA_EXP */
#define FLASHC_V2_BIST_WORK_DATA_EXP_DATA_Pos   0UL
#define FLASHC_V2_BIST_WORK_DATA_EXP_DATA_Msk   0xFFFFFFFFUL
/* FLASHC.BIST_WORK_DATA_ECC_ACT */
#define FLASHC_V2_BIST_WORK_DATA_ECC_ACT_DATA_ECC_Pos 0UL
#define FLASHC_V2_BIST_WORK_DATA_ECC_ACT_DATA_ECC_Msk 0x7FUL
/* FLASHC.BIST_WORK_DATA_ECC_EXP */
#define FLASHC_V2_BIST_WORK_DATA_ECC_EXP_DATA_ECC_Pos 0UL
#define FLASHC_V2_BIST_WORK_DATA_ECC_EXP_DATA_ECC_Msk 0x7FUL
/* FLASHC.BIST_WORK_ADDR */
#define FLASHC_V2_BIST_WORK_ADDR_COL_ADDR_Pos   0UL
#define FLASHC_V2_BIST_WORK_ADDR_COL_ADDR_Msk   0xFFFFUL
#define FLASHC_V2_BIST_WORK_ADDR_ROW_ADDR_Pos   16UL
#define FLASHC_V2_BIST_WORK_ADDR_ROW_ADDR_Msk   0xFFFF0000UL
/* FLASHC.BIST_WORK_STATUS */
#define FLASHC_V2_BIST_WORK_STATUS_FAIL_Pos     0UL
#define FLASHC_V2_BIST_WORK_STATUS_FAIL_Msk     0x1UL
/* FLASHC.BIST_ADDR_STOP */
#define FLASHC_V2_BIST_ADDR_STOP_COL_ADDR_STOP_Pos 0UL
#define FLASHC_V2_BIST_ADDR_STOP_COL_ADDR_STOP_Msk 0xFFFFUL
#define FLASHC_V2_BIST_ADDR_STOP_ROW_ADDR_STOP_Pos 16UL
#define FLASHC_V2_BIST_ADDR_STOP_ROW_ADDR_STOP_Msk 0xFFFF0000UL
/* FLASHC.ECC_CTL */
#define FLASHC_V2_ECC_CTL_WORD_ADDR_Pos         0UL
#define FLASHC_V2_ECC_CTL_WORD_ADDR_Msk         0xFFFFFFUL
#define FLASHC_V2_ECC_CTL_PARITY_Pos            24UL
#define FLASHC_V2_ECC_CTL_PARITY_Msk            0xFF000000UL
/* FLASHC.FM_SRAM_ECC_CTL0 */
#define FLASHC_V2_FM_SRAM_ECC_CTL0_ECC_INJ_DATA_Pos 0UL
#define FLASHC_V2_FM_SRAM_ECC_CTL0_ECC_INJ_DATA_Msk 0xFFFFFFFFUL
/* FLASHC.FM_SRAM_ECC_CTL1 */
#define FLASHC_V2_FM_SRAM_ECC_CTL1_ECC_INJ_PARITY_Pos 0UL
#define FLASHC_V2_FM_SRAM_ECC_CTL1_ECC_INJ_PARITY_Msk 0x7FUL
/* FLASHC.FM_SRAM_ECC_CTL2 */
#define FLASHC_V2_FM_SRAM_ECC_CTL2_CORRECTED_DATA_Pos 0UL
#define FLASHC_V2_FM_SRAM_ECC_CTL2_CORRECTED_DATA_Msk 0xFFFFFFFFUL
/* FLASHC.FM_SRAM_ECC_CTL3 */
#define FLASHC_V2_FM_SRAM_ECC_CTL3_ECC_ENABLE_Pos 0UL
#define FLASHC_V2_FM_SRAM_ECC_CTL3_ECC_ENABLE_Msk 0x1UL
#define FLASHC_V2_FM_SRAM_ECC_CTL3_ECC_INJ_EN_Pos 4UL
#define FLASHC_V2_FM_SRAM_ECC_CTL3_ECC_INJ_EN_Msk 0x10UL
#define FLASHC_V2_FM_SRAM_ECC_CTL3_ECC_TEST_FAIL_Pos 8UL
#define FLASHC_V2_FM_SRAM_ECC_CTL3_ECC_TEST_FAIL_Msk 0x100UL
/* FLASHC.CM0_CA_CTL0 */
#define FLASHC_V2_CM0_CA_CTL0_RAM_ECC_EN_Pos    0UL
#define FLASHC_V2_CM0_CA_CTL0_RAM_ECC_EN_Msk    0x1UL
#define FLASHC_V2_CM0_CA_CTL0_RAM_ECC_INJ_EN_Pos 1UL
#define FLASHC_V2_CM0_CA_CTL0_RAM_ECC_INJ_EN_Msk 0x2UL
#define FLASHC_V2_CM0_CA_CTL0_WAY_Pos           16UL
#define FLASHC_V2_CM0_CA_CTL0_WAY_Msk           0x30000UL
#define FLASHC_V2_CM0_CA_CTL0_SET_ADDR_Pos      24UL
#define FLASHC_V2_CM0_CA_CTL0_SET_ADDR_Msk      0x7000000UL
#define FLASHC_V2_CM0_CA_CTL0_PREF_EN_Pos       30UL
#define FLASHC_V2_CM0_CA_CTL0_PREF_EN_Msk       0x40000000UL
#define FLASHC_V2_CM0_CA_CTL0_CA_EN_Pos         31UL
#define FLASHC_V2_CM0_CA_CTL0_CA_EN_Msk         0x80000000UL
/* FLASHC.CM0_CA_CTL1 */
#define FLASHC_V2_CM0_CA_CTL1_PWR_MODE_Pos      0UL
#define FLASHC_V2_CM0_CA_CTL1_PWR_MODE_Msk      0x3UL
#define FLASHC_V2_CM0_CA_CTL1_VECTKEYSTAT_Pos   16UL
#define FLASHC_V2_CM0_CA_CTL1_VECTKEYSTAT_Msk   0xFFFF0000UL
/* FLASHC.CM0_CA_CTL2 */
#define FLASHC_V2_CM0_CA_CTL2_PWRUP_DELAY_Pos   0UL
#define FLASHC_V2_CM0_CA_CTL2_PWRUP_DELAY_Msk   0x3FFUL
/* FLASHC.CM0_CA_STATUS0 */
#define FLASHC_V2_CM0_CA_STATUS0_VALID32_Pos    0UL
#define FLASHC_V2_CM0_CA_STATUS0_VALID32_Msk    0xFFFFFFFFUL
/* FLASHC.CM0_CA_STATUS1 */
#define FLASHC_V2_CM0_CA_STATUS1_TAG_Pos        0UL
#define FLASHC_V2_CM0_CA_STATUS1_TAG_Msk        0xFFFFFFFFUL
/* FLASHC.CM0_CA_STATUS2 */
#define FLASHC_V2_CM0_CA_STATUS2_LRU_Pos        0UL
#define FLASHC_V2_CM0_CA_STATUS2_LRU_Msk        0x3FUL
/* FLASHC.CM0_STATUS */
#define FLASHC_V2_CM0_STATUS_MAIN_INTERNAL_ERR_Pos 0UL
#define FLASHC_V2_CM0_STATUS_MAIN_INTERNAL_ERR_Msk 0x1UL
#define FLASHC_V2_CM0_STATUS_WORK_INTERNAL_ERR_Pos 1UL
#define FLASHC_V2_CM0_STATUS_WORK_INTERNAL_ERR_Msk 0x2UL
/* FLASHC.CM4_CA_CTL0 */
#define FLASHC_V2_CM4_CA_CTL0_RAM_ECC_EN_Pos    0UL
#define FLASHC_V2_CM4_CA_CTL0_RAM_ECC_EN_Msk    0x1UL
#define FLASHC_V2_CM4_CA_CTL0_RAM_ECC_INJ_EN_Pos 1UL
#define FLASHC_V2_CM4_CA_CTL0_RAM_ECC_INJ_EN_Msk 0x2UL
#define FLASHC_V2_CM4_CA_CTL0_WAY_Pos           16UL
#define FLASHC_V2_CM4_CA_CTL0_WAY_Msk           0x30000UL
#define FLASHC_V2_CM4_CA_CTL0_SET_ADDR_Pos      24UL
#define FLASHC_V2_CM4_CA_CTL0_SET_ADDR_Msk      0x7000000UL
#define FLASHC_V2_CM4_CA_CTL0_PREF_EN_Pos       30UL
#define FLASHC_V2_CM4_CA_CTL0_PREF_EN_Msk       0x40000000UL
#define FLASHC_V2_CM4_CA_CTL0_CA_EN_Pos         31UL
#define FLASHC_V2_CM4_CA_CTL0_CA_EN_Msk         0x80000000UL
/* FLASHC.CM4_CA_CTL1 */
#define FLASHC_V2_CM4_CA_CTL1_PWR_MODE_Pos      0UL
#define FLASHC_V2_CM4_CA_CTL1_PWR_MODE_Msk      0x3UL
#define FLASHC_V2_CM4_CA_CTL1_VECTKEYSTAT_Pos   16UL
#define FLASHC_V2_CM4_CA_CTL1_VECTKEYSTAT_Msk   0xFFFF0000UL
/* FLASHC.CM4_CA_CTL2 */
#define FLASHC_V2_CM4_CA_CTL2_PWRUP_DELAY_Pos   0UL
#define FLASHC_V2_CM4_CA_CTL2_PWRUP_DELAY_Msk   0x3FFUL
/* FLASHC.CM4_CA_STATUS0 */
#define FLASHC_V2_CM4_CA_STATUS0_VALID32_Pos    0UL
#define FLASHC_V2_CM4_CA_STATUS0_VALID32_Msk    0xFFFFFFFFUL
/* FLASHC.CM4_CA_STATUS1 */
#define FLASHC_V2_CM4_CA_STATUS1_TAG_Pos        0UL
#define FLASHC_V2_CM4_CA_STATUS1_TAG_Msk        0xFFFFFFFFUL
/* FLASHC.CM4_CA_STATUS2 */
#define FLASHC_V2_CM4_CA_STATUS2_LRU_Pos        0UL
#define FLASHC_V2_CM4_CA_STATUS2_LRU_Msk        0x3FUL
/* FLASHC.CM4_STATUS */
#define FLASHC_V2_CM4_STATUS_MAIN_INTERNAL_ERR_Pos 0UL
#define FLASHC_V2_CM4_STATUS_MAIN_INTERNAL_ERR_Msk 0x1UL
#define FLASHC_V2_CM4_STATUS_WORK_INTERNAL_ERR_Pos 1UL
#define FLASHC_V2_CM4_STATUS_WORK_INTERNAL_ERR_Msk 0x2UL
/* FLASHC.CRYPTO_BUFF_CTL */
#define FLASHC_V2_CRYPTO_BUFF_CTL_PREF_EN_Pos   30UL
#define FLASHC_V2_CRYPTO_BUFF_CTL_PREF_EN_Msk   0x40000000UL
/* FLASHC.DW0_BUFF_CTL */
#define FLASHC_V2_DW0_BUFF_CTL_PREF_EN_Pos      30UL
#define FLASHC_V2_DW0_BUFF_CTL_PREF_EN_Msk      0x40000000UL
/* FLASHC.DW1_BUFF_CTL */
#define FLASHC_V2_DW1_BUFF_CTL_PREF_EN_Pos      30UL
#define FLASHC_V2_DW1_BUFF_CTL_PREF_EN_Msk      0x40000000UL
/* FLASHC.DMAC_BUFF_CTL */
#define FLASHC_V2_DMAC_BUFF_CTL_PREF_EN_Pos     30UL
#define FLASHC_V2_DMAC_BUFF_CTL_PREF_EN_Msk     0x40000000UL
/* FLASHC.EXT_MS0_BUFF_CTL */
#define FLASHC_V2_EXT_MS0_BUFF_CTL_PREF_EN_Pos  30UL
#define FLASHC_V2_EXT_MS0_BUFF_CTL_PREF_EN_Msk  0x40000000UL
/* FLASHC.EXT_MS1_BUFF_CTL */
#define FLASHC_V2_EXT_MS1_BUFF_CTL_PREF_EN_Pos  30UL
#define FLASHC_V2_EXT_MS1_BUFF_CTL_PREF_EN_Msk  0x40000000UL


#endif /* _CYIP_FLASHC_V2_H_ */


/* [] END OF FILE */
